alert(
  `Хотів здати раніше але 4 дні були проблеми з інтернетом( На цей раз питань трохи більше
    1) При використанні медіа запитів виникли проблеми з тим, що вони виконуються з деяким віхиленням (15-18px), в деяких випадках це ламало верстку при наближенні до 1200px. В секції our-team довелось при 1200px ставити  flex-wrap:nowrap, а в портфоліо замість фіксованої ширини елементів списку ставити width: min(370px, 31.5%). Це все виглядає, як костилі. Наскільки я зрозумів, ця проблема виникає через вертикальний скроллбар (при використанні вкладки в дев. тулзах "toggle device toolbar" цієї проблеми немає, є лише якщо просто змінювати ширину сторінки браузера). Які є підходи до цієї проблеми? Пробував рішення звідси "https://css-tricks.com/forums/topic/best-media-query-excluding-scroll-solution/", але якось не допомогло.
    2)   `
);
