alert(
  `У нас в ТЗ написано, що максимальна вкладеність селекторів - 2 рівня. Я не зрозумів, 2 рівня це так "selector1>selector2" чи так "selector1>selector2>selector3"? Якщо 2й варіант, то формально я це виконав, але мені здається, що з вкладеністю я перебрав. Буду вдячний, якщо покажете в SASS-фрагментах, як робити не треба.
  І одне невелике питання. В хедері в контактах (в самому кінці файла _header.scss) для ховера/фокуса іконок використовується конкатенація одразу декількох селекторів. Я розумію, що тут краще було б зробити це окремо для .mail__icon та .phone__icon, але воно досить цікаво працює. Таке взагалі десь може бути корисним? Чи концатенацию слід використовувати виключно для одного селектора?
  А, і ще одне. При відкритій модалці при зміні фокусу через tab, коли закінчуються елементи модалки, воно переходить на елементи основної сторінки і таким чином скролить її за модалкою, це виглядає дивно. З цим треба щось робити?   `
);
