alert(
  `Хотів здати раніше але 4 дні були проблеми з інтернетом( На цей раз питань трохи більше
    1) При використанні медіа запитів виникли проблеми з тим, що вони виконуються з деяким відхиленням (15-18px), в деяких випадках це ламало верстку при наближенні до 1200px. В секції our-team довелось при 1200+px ставити  flex-wrap:nowrap, а в портфоліо замість фіксованої ширини елементів списку ставити width: min(370px, 31.5%). Це все виглядає, як костилі. Наскільки я зрозумів, ця проблема виникає через вертикальний скроллбар (при використанні вкладки в дев. тулзах "toggle device toolbar" цієї проблеми немає, є лише якщо просто змінювати ширину сторінки браузера). Які є підходи до цієї проблеми? Пробував пару підходів (посилання на них в логах, звідси, як виявилось, нічого копіювати не можна), але не допомогло. Чи повинно воно працювати? Може я робив щось не так?
    2) Перевіряв сторінку через lighthouse в Chrome, показник performance дещо просідає для мобільної версії у порівнянні з десктопною. В чому там проблема?
    3) Чи можна вже повністю переходити від jpeg до webp? Згідно з Caniuse підтрика вже є усюди крім IE та досить старих версій браузерів.    `
);
console.log(
  "https://css-tricks.com/forums/topic/best-media-query-excluding-scroll-solution/"
);
